Tekla Open API Reference for Tekla Structures 2025
AnalysisModel Methods
The AnalysisModel type exposes the following members.
Methods
Name | Description
Delete
 Deletes an analysis model. The AnalysisModelName has to be set.
GetIssues
 Get analysis model issues.
Insert
 Inserts a new analysis model into the Tekla Structures model. The AnalysisModelName has to be set.
Modify
 Modifies an analysis model. The AnalysisModelName has to be set.
Select()
 Selects an analysis model. Updates the model. The AnalysisModelName or ID has to be set.
 (Overrides AnalysisObject.Select().)
Select(Boolean)
 Selects an analysis model. The AnalysisModelName or ID has to be set.
Top
See Also
Reference
AnalysisModel Class
Tekla.Structures.Analysis Namespace